"""Վարժություն 1.10

Հաջորդ ֆունկցիան հաշվարկում է մաթեմատիկական ֆունկցիա, որը հայտնի է
Ակերմանի ֆունկցիա անվամբ

 def ackermann(x, y):
    if y == 0:
        return 0
    elif x == 0:
        return 2 * y
    elif y == 1:
        return 2
    else:
        return ackermann(x - 1, ackermann(x, y - 1))


Ի՞նչ կլինի հետևյալ կանչերի արդյունքը

ackermann(1, 5) -> կարտացվի 32

կատարման արդյունքոմ կլինի
x = 1   y = 5
x = 1   y = 4
x = 1   y = 3
x = 1   y = 2
x = 1   y = 1
x = 0   y = 2
x = 0   y = 4
x = 0   y = 8
x = 0   y = 16
վերջում 16 * 2 է կատարում  
և ստանում  պատասխան 32

ackermann(2, 4) -> կարտացվի 65536
 x =  2  y =  4
 x =  2  y =  3
 x =  2  y =  2
 x =  2  y =  1
 x =  1  y =  2
 x =  1  y =  1
 x =  0  y =  2
 x =  1  y =  4
 x =  1  y =  3
 x =  1  y =  2
 x =  1  y =  1
 x =  0  y =  2
 x =  0  y =  4
 x =  0  y =  8
 x =  1  y =  16
 x =  1  y =  15
 x =  1  y =  14
 x =  1  y =  13
 x =  1  y =  12
 x =  1  y =  11
 x =  1  y =  10
 x =  1  y =  9
 x =  1  y =  8
 x =  1  y =  7
 x =  1  y =  6
 x =  1  y =  5
 x =  1  y =  4
 x =  1  y =  3
 x =  1  y =  2
 x =  1  y =  1
 x =  0  y =  2
 x =  0  y =  4
 x =  0  y =  8
 x =  0  y =  16
 x =  0  y =  32
 x =  0  y =  64
 x =  0  y =  128
 x =  0  y =  256
 x =  0  y =  512
 x =  0  y =  1024
 x =  0  y =  2048
 x =  0  y =  4096
 x =  0  y =  8192
 x =  0  y =  16384
 x =  0  y =  32768

վերջում 32768* 2 է կատարում  
և ստանում  պատասխան 65536

ackermann(3, 3) -> կարտացվի 65536
 x =  3  y =  3
 x =  3  y =  2
 x =  3  y =  1
 x =  2  y =  2
 x =  2  y =  1
 x =  1  y =  2
 x =  1  y =  1
 x =  0  y =  2
 x =  2  y =  4
 x =  2  y =  3
 x =  2  y =  2
 x =  2  y =  1
 x =  1  y =  2
 x =  1  y =  1
 x =  0  y =  2
 x =  1  y =  4
 x =  1  y =  3
 x =  1  y =  2
 x =  1  y =  1
 x =  0  y =  2
 x =  0  y =  4
 x =  0  y =  8
 x =  1  y =  16
 x =  1  y =  15
 x =  1  y =  14
 x =  1  y =  13
 x =  1  y =  12
 x =  1  y =  11
 x =  1  y =  10
 x =  1  y =  9
 x =  1  y =  8
 x =  1  y =  7
 x =  1  y =  6
 x =  1  y =  5
 x =  1  y =  4
 x =  1  y =  3
 x =  1  y =  2
 x =  1  y =  1
 x =  0  y =  2
 x =  0  y =  4
 x =  0  y =  8
 x =  0  y =  16
 x =  0  y =  32
 x =  0  y =  64
 x =  0  y =  128
 x =  0  y =  256
 x =  0  y =  512
 x =  0  y =  1024
 x =  0  y =  2048
 x =  0  y =  4096
 x =  0  y =  8192
 x =  0  y =  16384
 x =  0  y =  32768

վերջում 32768* 2 է կատարում  
և ստանում  պատասխան 65536

Կարճ նկարագրեք, թե ինչ են հաշվում a1, a2, և a3 ֆունկցիաները

 def a1(n):
    return ackermann(0, n)
    
    a1(n)-ը կաչելու ժամանակ կանչվելու է 
    ackermann(0, n) - ը եվ հետ է վերադարձնելու 2 * n։


def a2(n):
    return ackermann(1, n)

    a1(n)-ը կաչելու ժամանակ կանչվելու է 
    ackermann(0, n) - ը  կատարվելու է 
    x = 1   y = n
    x = 1   y = n - 1
    .
    .
    .
    այնքան ժամանակ որ n - ը հավասար լինի 1 - ի հետո հետ 
    քանի որ y = 1 -ի return է արվելու 2 եվ ackermann(x - 1, 2) է 
    տրվելու ֆունկցիաին և հետադարձ կատարվելու է 2 * y գործողությունը
    x = 0   y = 2
    . 
    .
    .
    x = 0   y = 2^n


def a3(n):
    return ackermann(2, n)



"""